---

C#Visual BasicVisual C++

Revit 2024 API
---
ElementId Constructor (Int64)
ElementId Class See Also Send Feedback
---

Create an ElementId handle with the given 64-bit integer id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024

# Syntax

C#
---

    public ElementId(
    	long id
    )

Visual Basic
---

    Public Sub New ( _
    	id As Long _
    )

Visual C++
---

    public:
    ElementId(
    	long long id
    )

#### Parameters

id
    Type: System..::..Int64The id.

# See Also

ElementId Class

ElementId Overload

Autodesk.Revit.DB Namespace